export const MessagesMap = {
  SIGNUP_FAILED: 'Користувач з таким email вже зареєстрований',
  CONFIRM_LINK_SENT: `Акаунт успішно створено.
    Для продовження роботи необхідно підтвердити вказаний email.
    На %s надіслано лінк для його підтвердження.`,
  LOGIN_FAILED: 'Невірний email або пароль',
  NOT_CONFIRMED: `Ваш email ще не підтверджено. Лінк для його підтвердження був надісланий на %s.
    Для того щоб надіслати лінк ще раз - скористайтесь опцією 'УВІЙТИ ЧЕРЕЗ EMAIL'.`,
  RESTORE_LINK_SENT: 'Лінк відправлено на %s',
  RESTORE_LINK_NOT_SENT: 'Не можливо надіслати лінк на %s',
  ACCOUNT_DELETED: 'Акаунт успішно видалено',
  ACCOUNT_NOT_DELETED: 'Не вдалося видалити акаунт',
  BAD_LINK: 'Невірний лінк',
  CONFIRM_SUCCESS: 'Email успішно підтверджено',
  LOGOUT_FAILED: 'Не вдалося вийти з акаунту',
  BAD_REQUEST: 'Сталася невідома помилка',
  SERVER_ERROR: 'Сервіс недоступний',
};
