export const RULES = [
  'Власник приєднується за запрошенням іншого власника',
  "Власник від'єднується за бажанням або за рішенням більшості учасників кола",
  "Після від'єднання вибувший нічого не винен спільноті, а спільнота нічого не винна вибувшому",
  'Спільні ресурси (власність) належить спільноті, навіть якщо в спільноті один власник',
  `Власники вкладають в розвиток справи (реалізацію мети) ресурс (інтелектуальний, духовний,
  матеріальній, технологічний, інструментальний, інформаційний) за бажанням та по можливості`,
  `Прибуток (інтелектуальний, духовний, матеріальній, технологічний, інструментальний,
  інформаційний) розподіляється рівномірно між усіма власниками`,
  'Рішення приймаються за згодою всіх власників',
  'Ці правила змінюються за згодою всіх власників',
  'Кожен власник погоджується з цими правилами по факту приєднання',
  'За згодою всіх учасників кола власник переміщується на рівень ближче до ядра',
  `В разі відсутності координатора власники зобов'язані обрати його не довше ніж за три дні.
  Інакше всі учасники кола від'єднуються автоматично`,
  'Власник зобовязується ознайомити з цими правилами кожного учасника свого дерева',
];
